MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK30DX256VLK7/mcu.h
#define PREAMBLE                      0x00007F80      // CEA709.1-B Preamble Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TPL register.
//
//*****************************************************************************

#define TPL                           0x00007F80      // Transmit Packet Length Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IE register.
//
//*****************************************************************************

#define WBEIE                         0x00000040      // WBASE Expired Interrupt Enable
#define ISDIE                         0x00000020      // Initial Sync Detection Interrupt Enable
#define PRXIE                         0x00000010      // Packet Received Interrupt Enable
#define PTXIE                         0x00000008      // Packet Transmitted Interrupt Enable
#define PCTEIE                        0x00000004      // Packet Cycle Timer Interrupt Enable
#define PSIE                          0x00000002      // Preamble Start Interrupt Enable
#define TXFIE                         0x00000001      // Transmission Fail Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WB register.
//
//*****************************************************************************

#define WBASE                         0x00007F80      // CEA709.1-B WBASE register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S3 register.
//
//*****************************************************************************

#define PEF                           0x00000080      // Preamble Error Flag
#define WBEF                          0x00000040      // Wbase Expired Flag
#define ISD                           0x00000020      // Initial Sync Detect
#define PRXF                          0x00000010      // Packet Received Flag
#define PTXF                          0x00000008      // Packet Transmitted Flag
#define PCTEF                         0x00000004      // Packet Cycle Timer Expired Flag
#define PSF                           0x00000002      // Preamble Start Flag
#define TXFF                          0x00000001      // Transmission Fail Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S4 register.
//
//*****************************************************************************

#define INITF                         0x00000010      // Initial Synchronization Fail Flag
#define CDET                          0x00000018      // CDET
#define ILCV                          0x00000002      // Improper Line Code Violation
#define FE                            0x00000001      // Framing Error


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPL register.
//
//*****************************************************************************

#define RPL                           0x00007F80      // Received Packet Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPREL register.
//
//*****************************************************************************

#define RPREL                         0x00007F80      // Received Preamble Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_CPW register.
//
//*****************************************************************************

#define CPW                           0x00007F80      // CEA709.1-B CPW register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RIDT register.
//
//*****************************************************************************

#define RIDT                          0x00007F80      // CEA709.1-B Receive IDT register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TIDT register.
//
//*****************************************************************************

#define TIDT                          0x00007F80      // CEA709.1-B Transmit IDT Register


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCSR register.
//
//*****************************************************************************

#define TE                            0x80000000      // Transmitter Enable
#define STOPE                         0x40000000      // Stop Enable
#define DBGE                          0x20000000      // Debug Enable
#define BCE                           0x10000000      // Bit Clock Enable
#define FR                            0x02000000      // FIFO Reset
#define SR                            0x01000000      // Software Reset
#define WSF                           0x00100000      // Word Start Flag
#define SEF                           0x00080000      // Sync Error Flag
#define FEF                           0x00040000      // FIFO Error Flag
#define FWF                           0x00020000      // FIFO Warning Flag
#define FRF                           0x00010000      // FIFO Request Flag
#define WSIE                          0x00001000      // Word Start Interrupt Enable
#define SEIE                          0x00000800      // Sync Error Interrupt Enable
#define FEIE                          0x00000400      // FIFO Error Interrupt Enable
#define FWIE                          0x00000200      // FIFO Warning Interrupt Enable
#define FRIE                          0x00000100      // FIFO Request Interrupt Enable
#define FWDE                          0x00000002      // FIFO Warning DMA Enable
#define FRDE                          0x00000001      // FIFO Request DMA Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR1 register.
//
//*****************************************************************************

