MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK30DX256VLK7/mcu.h
#define LCDIF                         0x00008000      // LCD Frame Frequency Interrupt flag
#define BLINK                         0x00000080      // Blink command
#define ALT                           0x00000040      // Alternate display mode
#define BLANK                         0x00000020      // Blank display mode
#define BMODE                         0x00000010      // Blink mode
#define BRATE                         0x0000001C      // Blink-rate configuration


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDCR register.
//
//*****************************************************************************

#define FDPRS                         0x0001C000      // Fault Detect Clock Prescaler
#define FDSWW                         0x00003800      // Fault Detect Sample Window Width
#define FDEN                          0x00000100      // Fault Detect Enable
#define FDBPEN                        0x00000080      // Fault Detect Back Plane Enable
#define FDPINID                       0x00001FC0      // Fault Detect Pin ID


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDSR register.
//
//*****************************************************************************

#define FDCF                          0x00008000      // Fault Detection Complete Flag
#define FDCNT                         0x00007F80      // Fault Detect Counter


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_PENn register.
//
//*****************************************************************************

#define PEN                           0x7FFFFFFF80000000      // LCD Pin Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_BPENn register.
//
//*****************************************************************************

#define BPEN                          0x7FFFFFFF80000000      // Back Plane Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF3TO0 register.
//
//*****************************************************************************

#define WF3                           0x7F80000000      // Segment-on front plane operation — Each bit turns on or off the segments associated with LCD_P3 in the following pattern: HGFEDCBA (most significant bit controls segment H and least significant bit controls segment A). Segment-on back plane operation — Each bit activates or deactivates the phases associated with LCD_P3 in the following pattern: HGFEDCBA (most significant bit controls phase H and least significant bit controls phase A).
#define WF2                           0x7F800000      // Controls segments or phases connected to LCD_P2 as described above for WF3
#define WF1                           0x007F8000      // Controls segments or phases connected to LCD_P1 as described above for WF3
#define WF0                           0x00007F80      // Controls segments or phases connected to LCD_P0 as described above for WF3


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF7TO4 register.
//
//*****************************************************************************

#define WF7                           0x7F80000000      // Controls segments or phases connected to LCD_P7 as described above for WF3TO0[WF3]
#define WF6                           0x7F800000      // Controls segments or phases connected to LCD_P6 as described above for WF3TO0[WF3]
#define WF5                           0x007F8000      // Controls segments or phases connected to LCD_P5 as described above for WF3TO0[WF3]
#define WF4                           0x00007F80      // Controls segments or phases connected to LCD_P4 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF11TO8 register.
//
//*****************************************************************************

#define WF11                          0x7F80000000      // Controls segments or phases connected to LCD_P11 as described above for WF3TO0[WF3]
#define WF10                          0x7F800000      // Controls segments or phases connected to LCD_P10 as described above for WF3TO0[WF3]
#define WF9                           0x007F8000      // Controls segments or phases connected to LCD_P9 as described above for WF3TO0[WF3]
#define WF8                           0x00007F80      // Controls segments or phases connected to LCD_P8 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF15TO12 register.
//
//*****************************************************************************

#define WF15                          0x7F80000000      // Controls segments or phases connected to LCD_P15 as described above for WF3TO0[WF3]
#define WF14                          0x7F800000      // Controls segments or phases connected to LCD_P14 as described above for WF3TO0[WF3]
#define WF13                          0x007F8000      // Controls segments or phases connected to LCD_P13 as described above for WF3TO0[WF3]
#define WF12                          0x00007F80      // Controls segments or phases connected to LCD_P12 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF19TO16 register.
//
//*****************************************************************************

#define WF19                          0x7F80000000      // Controls segments or phases connected to LCD_P19 as described above for WF3TO0[WF3]
#define WF18                          0x7F800000      // Controls segments or phases connected to LCD_P18 as described above for WF3TO0[WF3]
#define WF17                          0x007F8000      // Controls segments or phases connected to LCD_P17 as described above for WF3TO0[WF3]
#define WF16                          0x00007F80      // Controls segments or phases connected to LCD_P16 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF23TO20 register.
//
//*****************************************************************************

