MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK30DX256VLK7/mcu.h
#define WF23                          0x7F80000000      // Controls segments or phases connected to LCD_P23 as described above for WF3TO0[WF3]
#define WF22                          0x7F800000      // Controls segments or phases connected to LCD_P22 as described above for WF3TO0[WF3]
#define WF21                          0x007F8000      // Controls segments or phases connected to LCD_P21 as described above for WF3TO0[WF3]
#define WF20                          0x00007F80      // Controls segments or phases connected to LCD_P20 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF27TO24 register.
//
//*****************************************************************************

#define WF27                          0x7F80000000      // Controls segments or phases connected to LCD_P27 as described above for WF3TO0[WF3]
#define WF26                          0x7F800000      // Controls segments or phases connected to LCD_P26 as described above for WF3TO0[WF3]
#define WF25                          0x007F8000      // Controls segments or phases connected to LCD_P25 as described above for WF3TO0[WF3]
#define WF24                          0x00007F80      // Controls segments or phases connected to LCD_P24 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF31TO28 register.
//
//*****************************************************************************

#define WF31                          0x7F80000000      // Controls segments or phases connected to LCD_P31 as described above for WF3TO0[WF3]
#define WF30                          0x7F800000      // Controls segments or phases connected to LCD_P30 as described above for WF3TO0[WF3]
#define WF29                          0x007F8000      // Controls segments or phases connected to LCD_P29 as described above for WF3TO0[WF3]
#define WF28                          0x00007F80      // Controls segments or phases connected to LCD_P28 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF35TO32 register.
//
//*****************************************************************************

#define WF35                          0x7F80000000      // Controls segments or phases connected to LCD_P35 as described above for WF3TO0[WF3]
#define WF34                          0x7F800000      // Controls segments or phases connected to LCD_P34 as described above for WF3TO0[WF3]
#define WF33                          0x007F8000      // Controls segments or phases connected to LCD_P33 as described above for WF3TO0[WF3]
#define WF32                          0x00007F80      // Controls segments or phases connected to LCD_P32 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF39TO36 register.
//
//*****************************************************************************

#define WF39                          0x7F80000000      // Controls segments or phases connected to LCD_P39 as described above for WF3TO0[WF3]
#define WF38                          0x7F800000      // Controls segments or phases connected to LCD_P38 as described above for WF3TO0[WF3]
#define WF37                          0x007F8000      // Controls segments or phases connected to LCD_P37 as described above for WF3TO0[WF3]
#define WF36                          0x00007F80      // Controls segments or phases connected to LCD_P36 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF43TO40 register.
//
//*****************************************************************************

#define WF43                          0x7F80000000      // Controls segments or phases connected to LCD_P43 as described above for WF3TO0[WF3]
#define WF42                          0x7F800000      // Controls segments or phases connected to LCD_P42 as described above for WF3TO0[WF3]
#define WF41                          0x007F8000      // Controls segments or phases connected to LCD_P41 as described above for WF3TO0[WF3]
#define WF40                          0x00007F80      // Controls segments or phases connected to LCD_P40 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF47TO44 register.
//
//*****************************************************************************

#define WF47                          0x7F80000000      // Controls segments or phases connected to LCD_P47 as described above for WF3TO0[WF3]
#define WF46                          0x7F800000      // Controls segments or phases connected to LCD_P46 as described above for WF3TO0[WF3]
#define WF45                          0x007F8000      // Controls segments or phases connected to LCD_P45 as described above for WF3TO0[WF3]
#define WF44                          0x00007F80      // Controls segments or phases connected to LCD_P44 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF51TO48 register.
//
//*****************************************************************************

#define WF51                          0x7F80000000      // Controls segments or phases connected to LCD_P51 as described above for WF3TO0[WF3]
#define WF50                          0x7F800000      // Controls segments or phases connected to LCD_P50 as described above for WF3TO0[WF3]
#define WF49                          0x007F8000      // Controls segments or phases connected to LCD_P49 as described above for WF3TO0[WF3]
#define WF48                          0x00007F80      // Controls segments or phases connected to LCD_P48 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF55TO52 register.
//
//*****************************************************************************

#define WF55                          0x7F80000000      // Controls segments or phases connected to LCD_P55 as described above for WF3TO0[WF3]
#define WF54                          0x7F800000      // Controls segments or phases connected to LCD_P54 as described above for WF3TO0[WF3]
#define WF53                          0x007F8000      // Controls segments or phases connected to LCD_P53 as described above for WF3TO0[WF3]
#define WF52                          0x00007F80      // Controls segments or phases connected to LCD_P52 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF59TO56 register.
//
//*****************************************************************************

#define WF59                          0x7F80000000      // Controls segments or phases connected to LCD_P59 as described above for WF3TO0[WF3]
#define WF58                          0x7F800000      // Controls segments or phases connected to LCD_P58 as described above for WF3TO0[WF3]
#define WF57                          0x007F8000      // Controls segments or phases connected to LCD_P57 as described above for WF3TO0[WF3]
#define WF56                          0x00007F80      // Controls segments or phases connected to LCD_P56 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF63TO60 register.
//
//*****************************************************************************

#define WF63                          0x7F80000000      // Controls segments or phases connected to LCD_P63 as described above for WF3TO0[WF3]
#define WF62                          0x7F800000      // Controls segments or phases connected to LCD_P62 as described above for WF3TO0[WF3]
#define WF61                          0x007F8000      // Controls segments or phases connected to LCD_P61 as described above for WF3TO0[WF3]
#define WF60                          0x00007F80      // Controls segments or phases connected to LCD_P60 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_MPRA register.
//
//*****************************************************************************

#define MTR0                          0x40000000      // Master Trusted For Read
#define MTW0                          0x20000000      // Master Trusted For Writes
#define MPL0                          0x10000000      // Master Privilege Level
#define MTR1                          0x04000000      // Master trusted for read
#define MTW1                          0x02000000      // Master trusted for writes
#define MPL1                          0x01000000      // Master privilege level
#define MTR2                          0x00400000      // Master Trusted For Read
#define MTW2                          0x00200000      // Master Trusted For Writes
#define MPL2                          0x00100000      // Master Privilege Level


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_PACRn register.
//
//*****************************************************************************

